In [ ]:
install.packages("dplyr")

In [3]:
library(dplyr)
library(ggplot2)  
library(tidyverse)

In [4]:
df <- read.csv("C:\\Users\\Dell\\Downloads\\R_Programming\\ML\\StudentsPerformance.csv")
head(df,3)

  gender race.ethnicity parental.level.of.education lunch
1 female group B        bachelor's degree           standard
2 female group C        some college                standard
3 female group B        master's degree             standard
  test.preparation.course math.score reading.score writing.score
1 none                    72         72            74
2 completed               69         90            88
3 none                    90         95            93

In [6]:
colnames(df) <- c("Gender","RE","PLE","Lunch","TPC","Math","Reading","Writing")
head(df,3)

  Gender RE      PLE               Lunch    TPC       Math Reading Writing
1 female group B bachelor's degree standard none      72   72      74
2 female group C some college      standard completed 69   90      88
3 female group B master's degree   standard none      90   95      93

In [11]:
dim(df)

[1] 1000    8

#### Value Counts

In [8]:
table(df$RE)

group A group B group C group D group E
     89     190     319     262     140

In [10]:
table(df$RE,df$Lunch)

          free/reduced standard
  group A           36       53
  group B           69      121
  group C          114      205
  group D           95      167
  group E           41       99

In [14]:
xtabs(~RE+Lunch,data=df)
# contingency table

         Lunch
RE        free/reduced standard
  group A           36       53
  group B           69      121
  group C          114      205
  group D           95      167
  group E           41       99

### Five basic functions from dplyr 
filter, select, arrange, mutate, group_by

### 1) Filtering

#### Filter using R

In [19]:
r1 <- df[df$Lunch=="standard" & df$RE=="group C",]
print(dim(r1))
head(r1,5)

[1] 205   8

   Gender RE      PLE                Lunch    TPC       Math Reading Writing
2  female group C some college       standard completed 69   90      88
5  male   group C some college       standard none      76   78      75
11 male   group C associate's degree standard none      58   54      52
16 female group C some high school   standard none      69   75      78
17 male   group C high school        standard none      88   89      86

#### Filter using dplyr

In [20]:
r2 <- filter(df,Lunch=="standard", RE=="group C")  # , denotes AND
dim(r2)
head(r2,3)

[1] 205   8

  Gender RE      PLE                Lunch    TPC       Math Reading Writing
1 female group C some college       standard completed 69   90      88
2 male   group C some college       standard none      76   78      75
3 male   group C associate's degree standard none      58   54      52

In [22]:
r3 <- filter(df,TPC=="completed" | RE=="group A")  # | denotes OR
dim(r3)
head(r3,3)

[1] 416   8

  Gender RE      PLE                Lunch        TPC       Math Reading Writing
1 female group C some college       standard     completed 69   90      88
2 male   group A associate's degree free/reduced none      47   57      44
3 female group B some college       standard     completed 88   95      92

In [23]:
r4 <- filter(df, RE %in% c("group A", "group D"))
dim(r4)
table(r4$RE)
head(r4,3)

[1] 351   8

group A group B group C group D group E
     89       0       0     262       0

  Gender RE      PLE                Lunch        TPC       Math Reading Writing
1 male   group A associate's degree free/reduced none      47   57      44
2 male   group D high school        free/reduced completed 64   64      67
3 male   group D associate's degree standard     none      40   52      43

### 2) Column Selection

#### Column selection using R basics

In [13]:
r5 <- df[c(-1,-4,-6)]
head(r5,4)

  RE      PLE                TPC       Reading Writing
1 group B bachelor's degree  none      72      74
2 group C some college       completed 90      88
3 group B master's degree    none      95      93
4 group A associate's degree none      57      44

#### Column selection using dplyr

In [26]:
r6 <- select(df, Lunch, RE, Reading)
head(r6,4)

  Lunch        RE      Reading
1 standard     group B 72
2 standard     group C 90
3 standard     group B 95
4 free/reduced group A 57

In [28]:
r7 <- filter(select(df, RE, TPC, Lunch, Math, Reading), Math > 70)
head(r7,4)

  RE      TPC  Lunch    Math Reading
1 group B none standard 72   72
2 group B none standard 90   95
3 group C none standard 76   78
4 group B none standard 71   83

### 3) Chaning using dplyr

In [29]:
# Seletcion with filter using chaining
a1 <- df %>% 
      select(Gender, RE,TPC,Math,Writing) %>% 
      filter(Writing > 60)
head(a1,5)

  Gender RE      TPC       Math Writing
1 female group B none      72   74
2 female group C completed 69   88
3 female group B none      90   93
4 male   group C none      76   75
5 female group B none      71   78

In [32]:
# selection with ordering using dplyr
a2 <- df %>% 
      select(Gender, RE,TPC,Math,Writing) %>% 
      arrange(Math)  # in asc order of Math
head(a2,5)

  Gender RE      TPC  Math Writing
1 female group C none  0   10
2 female group B none  8   23
3 female group B none 18   28
4 female group B none 19   32
5 female group C none 22   33

In [33]:
# selection with ordering using dplyr
a3 <- df %>% 
      select(Gender, RE,TPC,Math,Writing) %>% 
      arrange(desc(Writing))  # in asc order of Math
head(a3,5)

  Gender RE      TPC       Math Writing
1 female group D none      87   100
2 female group E completed 99   100
3 female group C completed 96   100
4 female group D completed 97   100
5 female group D completed 85   100

### 4) Mutate using dplyr
Used to create new fetures

In [35]:
df1 <- data.frame(df)            # Create copy of data
colnames(df1)   
tracemem(df1) == tracemem(df)

[1] "Gender"  "RE"      "PLE"     "Lunch"   "TPC"     "Math"    "Reading"
[8] "Writing"

[1] FALSE

#### 1) Without dplyr

In [37]:
df1$Math_Per <- df$Math/100
head(df1,3)

  Gender RE      PLE               Lunch    TPC       Math Reading Writing
1 female group B bachelor's degree standard none      72   72      74
2 female group C some college      standard completed 69   90      88
3 female group B master's degree   standard none      90   95      93
  Math_Per
1 0.72
2 0.69
3 0.90

#### 2) With dplyr

In [38]:
a4 <- df %>%
    select(Gender, RE,TPC,Math,Writing) %>%
    mutate(Writing_per = Writing/100)

head(a4,4)

  Gender RE      TPC       Math Writing Writing_per
1 female group B none      72   74      0.74
2 female group C completed 69   88      0.88
3 female group B none      90   93      0.93
4 male   group A none      47   44      0.44

In [39]:
# strore the new variable
df1 <- df1 %>% mutate(Writing_per = Writing/100)
head(df1,3)

  Gender RE      PLE               Lunch    TPC       Math Reading Writing
1 female group B bachelor's degree standard none      72   72      74
2 female group C some college      standard completed 69   90      88
3 female group B master's degree   standard none      90   95      93
  Math_Per Writing_per
1 0.72     0.74
2 0.69     0.88
3 0.90     0.93

#### Group by using dplyr

In [40]:
g1 <- df %>%
        group_by(RE) %>%
        summarise(Mean_Math = mean(Math, na.rm=TRUE))
g1

  RE      Mean_Math
1 group A 61.62921
2 group B 63.45263
3 group C 64.46395
4 group D 67.36260
5 group E 73.82143

In [41]:
g2 = df %>% group_by(RE, Gender) %>%
                   summarise(Mean_Math = mean(Math),
                             Sum_Writing = sum(Writing))
g2

   RE      Gender Mean_Math Sum_Writing
1  group A female 58.52778   2443
2  group A male   63.73585   3135
3  group B female 61.40385   7285
4  group B male   65.93023   5179
5  group C female 62.03333  12920
6  group C male   67.61151   8717
7  group D female 65.24806   9678
8  group D male   69.41353   8700
9  group E female 70.81159   5212
10 group E male   76.74648   4785

In [45]:
g3 = df %>% group_by(RE, Gender) %>%
                   summarise(Mean_Math = mean(Math),
                             Sum_Writing = sum(Writing)) %>%
                    arrange(Sum_Writing)
g3

   RE      Gender Mean_Math Sum_Writing
1  group A female 58.52778   2443
2  group A male   63.73585   3135
3  group E male   76.74648   4785
4  group B male   65.93023   5179
5  group E female 70.81159   5212
6  group B female 61.40385   7285
7  group D male   69.41353   8700
8  group C male   67.61151   8717
9  group D female 65.24806   9678
10 group C female 62.03333  12920

In [43]:
a4 <- df %>%
    group_by(RE, Gender) %>%
    tally(sort = TRUE)
a4

   RE      Gender n
1  group C female 180
2  group C male   139
3  group D male   133
4  group D female 129
5  group B female 104
6  group B male    86
7  group E male    71
8  group E female  69
9  group A male    53
10 group A female  36

In [15]:
head(mtcars,2)

              mpg cyl disp hp  drat wt    qsec  vs am gear carb
Mazda RX4     21  6   160  110 3.9  2.620 16.46 0  1  4    4
Mazda RX4 Wag 21  6   160  110 3.9  2.875 17.02 0  1  4    4

In [16]:
df1 <- tbl_df(mtcars)
head(df1,3)

  mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1 21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
2 21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
3 22.8 4   108   93 3.85 2.320 18.61 1  1  4    1

#### Group by